app/controllers/presales_controller.rb

	def create
		@presale = Presale.new(presale_params)
		if @presale.save
---
INSERT INTO "presales" ("first_name", "zip_code", "bill", "desired_bill", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Lupita"], ["zip_code", "92840"], ["bill", 100], ["desired_bill", 9], ["created_at", 2017-04-09 00:25:57 UTC], ["updated_at", 2017-04-09 00:25:57 UTC]]

	def show
		@presale = Presale.find(params[:id])
---
SELECT  "presales".* FROM "presales" WHERE "presales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]